# MetalFinish Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Metal..::..MetalFinish Property
Metal Class See Also
---
The property labeled "Finish" from the "Metal" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetalFinish { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetalFinish As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetalFinish {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".
# See Also
Metal Class
Autodesk.Revit.DB.Visual Namespace